10/data/attachments/10a4aeae989f3ebb.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_13104b59-5eae-48e4-b3f4-b08c7f84fd6e</nif:username>
            <nif:friendToBeAdded>Ian_huge_Friend_26688_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>